nrfconnect/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
	/* RX */
	uint32_t alloced_cnt;
	uint32_t locked_cnt;

	ret = data_fifo_num_used_get(ctrl_blk.in.fifo, &alloced_cnt, &locked_cnt);
	if (alloced_cnt || locked_cnt || ret) {
		ERR_CHK_MSG(-ENOMEM, "Fifo is not empty!");
	}

	ret = data_fifo_pointer_first_vacant_get(ctrl_blk.in.fifo, (void **)&rx_buf_one, K_NO_WAIT);
	ERR_CHK_MSG(ret, "RX failed to get block");
	ret = data_fifo_pointer_first_vacant_get(ctrl_blk.in.fifo, (void **)&rx_buf_two, K_NO_WAIT);
	ERR_CHK_MSG(ret, "RX failed to get block");

	/* Start I2S */
	audio_i2s_start(tx_buf_one, rx_buf_one);
	audio_i2s_set_next_buf(tx_buf_two, rx_buf_two);
}

static void audio_datapath_i2s_stop(void)
{
	audio_i2s_stop();
	alt_buffer_free_both();
}

static bool update_cmpr_val_check_on(uint32_t seq_num)
{
	/* Checks if seq_num has wrapped */
	if (seq_num < sync_led_last_seq_num) {
		sync_led_last_seq_num = 0;
		return true;
	} else if (seq_num >= sync_led_last_seq_num + (SYNC_LED_SEQ_NR_PERIOD / 2)) {
		sync_led_last_seq_num = (seq_num / SYNC_LED_SEQ_NR_OFF) * SYNC_LED_SEQ_NR_OFF;
		return true;
	}

	return false;
}

static bool sync_led_toggle_check(uint32_t seq_num)
{
	if ((seq_num % SYNC_LED_SEQ_NR_PERIOD) >= SYNC_LED_SEQ_NR_OFF) {
		return true;
	} else {
		return false;
	}
}

int audio_datapath_pres_delay_us_set(uint32_t delay_us)
{
	if (delay_us > MAX_PRES_DLY_US || delay_us < MIN_PRES_DLY_US) {
		LOG_WRN("Presentation delay not supported: %d", delay_us);
		return -EINVAL;
	}

	ctrl_blk.pres_comp.pres_delay_us = delay_us;

	LOG_DBG("Presentation delay set to %d us", delay_us);

	return 0;
}

void audio_datapath_pres_delay_us_get(uint32_t *delay_us)
{
	*delay_us = ctrl_blk.pres_comp.pres_delay_us;
}

void audio_datapath_just_in_time_check_and_adjust(uint32_t sdu_ref_us)
{
	static int32_t count;
	int ret;

	uint32_t curr_frame_ts = audio_sync_timer_curr_time_get();
	int diff = curr_frame_ts - sdu_ref_us;

	if (count++ % 100 == 0) {
		LOG_DBG("Time from last anchor: %d", diff);
	}

	if (diff < JUST_IN_TIME_US - JUST_IN_TIME_THRESHOLD_US ||
	    diff > JUST_IN_TIME_US + JUST_IN_TIME_THRESHOLD_US) {
		ret = audio_system_fifo_rx_block_drop();
		if (ret) {
			LOG_WRN("Not able to drop FIFO RX block");
			return;
		}

		count = 0;
	}
}

void audio_datapath_sdu_ref_update(uint32_t sdu_ref_us)
{
	if (ctrl_blk.stream_started) {
		ctrl_blk.previous_sdu_ref_us = sdu_ref_us;
	} else {
		LOG_WRN("Stream not startet - Can not update sdu_ref_us");
	}
}

void audio_datapath_stream_out(const uint8_t *buf, size_t size, uint32_t sdu_ref_us,
			       uint32_t seq_num, bool bad_frame, uint32_t recv_frame_ts_us)
{
	static uint32_t last_sync_led_sdu_ref_us;

	/* Set compare value for blinking sync LED */
	if (update_cmpr_val_check_on(seq_num)) {
		uint32_t current_time_stamp = audio_sync_timer_curr_time_get();
		/**
		 * To obtain the desired blinking period sdu_ref_us is used, as the value increments
		 * proportional with seq_num and audio_frame_duration (with a slight deviation).
		 * Since the headsets receives the packages with a slight difference,
		 * the new_compare_time subtracts the difference between the time stamp of
		 * which the package is received and the sdu_ref_us.
		 */
		uint32_t new_compare_time =
			current_time_stamp +
			(sdu_ref_us - (last_sync_led_sdu_ref_us + (recv_frame_ts_us - sdu_ref_us)));

		audio_sync_timer_sync_led_cmpr_time_set(new_compare_time,
							sync_led_toggle_check(seq_num));
		last_sync_led_sdu_ref_us = sdu_ref_us;
	}

	if (!ctrl_blk.stream_started) {
		LOG_WRN("Stream not started");
		return;
	}

	/*** Check incoming data ***/

	if (!buf) {
		LOG_ERR("buf is NULL");
	}

	if (sdu_ref_us == ctrl_blk.previous_sdu_ref_us) {
		LOG_WRN("Duplicate sdu_ref_us (%d) - Dropping audio frame", sdu_ref_us);
		return;
	}

	if (bad_frame) {
		/* Error in the frame or frame lost - sdu_ref_us is stil valid */
		LOG_DBG("Bad audio frame");
	}

	bool sdu_ref_not_consecutive = false;

	if (ctrl_blk.previous_sdu_ref_us) {
		uint32_t sdu_ref_delta_us = sdu_ref_us - ctrl_blk.previous_sdu_ref_us;

		/* Check if the delta is from two consecutive frames */
		if (sdu_ref_delta_us <
		    (CONFIG_AUDIO_FRAME_DURATION_US + (CONFIG_AUDIO_FRAME_DURATION_US / 2))) {
			/* Check for invalid delta */
			if ((sdu_ref_delta_us >
			     (CONFIG_AUDIO_FRAME_DURATION_US + SDU_REF_DELTA_MAX_ERR_US)) ||
			    (sdu_ref_delta_us <
			     (CONFIG_AUDIO_FRAME_DURATION_US - SDU_REF_DELTA_MAX_ERR_US))) {
				LOG_DBG("Invalid sdu_ref_us delta (%d) - Estimating sdu_ref_us",
					sdu_ref_delta_us);

				/* Estimate sdu_ref_us */
				sdu_ref_us = ctrl_blk.previous_sdu_ref_us +
					     CONFIG_AUDIO_FRAME_DURATION_US;
			}
		} else {
			LOG_INF("sdu_ref_us not from consecutive frames");
			sdu_ref_not_consecutive = true;
		}
	}

	ctrl_blk.previous_sdu_ref_us = sdu_ref_us;

	/*** Presentation compensation ***/

	audio_datapath_presentation_compensation(recv_frame_ts_us, sdu_ref_us,
						 sdu_ref_not_consecutive);

	/*** Decode ***/

	int ret;
	size_t pcm_size;

	ret = sw_codec_decode(buf, size, bad_frame, &ctrl_blk.decoded_data, &pcm_size);

	if (ret) {
		LOG_WRN("SW codec decode error: %d", ret);
	}

	if (pcm_size != (BLK_STEREO_SIZE_OCTETS * NUM_BLKS_IN_FRAME)) {
		LOG_WRN("Decoded audio has wrong size");
		/* Discard frame */
		return;
	}

	/*** Add audio data to FIFO buffer ***/

	int32_t num_blks_in_fifo = ctrl_blk.out.prod_blk_idx - ctrl_blk.out.cons_blk_idx;

	if ((num_blks_in_fifo + NUM_BLKS_IN_FRAME) > FIFO_NUM_BLKS) {
		LOG_WRN("Output audio stream overrun - Discarding audio frame");

		/* Discard frame to allow consumer to catch up */
		return;
	}

	uint32_t out_blk_idx = ctrl_blk.out.prod_blk_idx;

	for (uint32_t i = 0; i < NUM_BLKS_IN_FRAME; i++) {
		memcpy(&ctrl_blk.out.fifo[out_blk_idx * BLK_STEREO_NUM_SAMPS],
		       &((int16_t *)ctrl_blk.decoded_data)[i * BLK_STEREO_NUM_SAMPS],
		       BLK_STEREO_SIZE_OCTETS);

		/* Record producer block start reference */
		ctrl_blk.out.prod_blk_ts[out_blk_idx] = recv_frame_ts_us + (i * BLK_PERIOD_US);

		out_blk_idx = NEXT_IDX(out_blk_idx);
	}

